Тестовое задание/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаАналогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАналогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Тестовое задание/InformationRegisters/АналогиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>АналогиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаАналогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАналогов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Тестовое задание/Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДанныеПоАналогам();	
	ТаблицаАналоговИзменилась = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоАналогам();
	
	ТаблицаАналогов.Очистить();
	Если ЗначениеЗаполнено(Объект.ГруппаАналогов) Тогда
		Элементы.ТаблицаАналогов.Доступность = Истина;
	Иначе
		Элементы.ТаблицаАналогов.Доступность = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ГруппаАналогов) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АналогиНоменклатуры.Номенклатура КАК Аналог
		|ИЗ
		|	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
		|ГДЕ
		|	АналогиНоменклатуры.ГруппаАналогов = &ГруппаАналогов
		|	И АналогиНоменклатуры.Номенклатура <> &Номенклатура";
		
		Запрос.УстановитьПараметр("ГруппаАналогов", Объект.ГруппаАналогов);
		Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ТаблицаАналогов.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЕсли;
	
	Элементы.ТаблицаАналогов.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаАналоговПриИзменении(Элемент)
	
	Если СтароеЗначениеГруппаАналогов <> Объект.ГруппаАналогов Тогда
		ОбновитьДанныеПоАналогам();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаАналоговНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтароеЗначениеГруппаАналогов = Объект.ГруппаАналогов;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.ГруппаАналогов) Тогда
		ОбработатьТаблицуАналоговПередЗаписью();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьТаблицуАналоговПередЗаписью()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АналогиНоменклатуры.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.АналогиНоменклатуры КАК АналогиНоменклатуры
		|ГДЕ
		|	АналогиНоменклатуры.ГруппаАналогов = &ГруппаАналогов
		|	И АналогиНоменклатуры.Номенклатура <> &Номенклатура";
	
	Запрос.УстановитьПараметр("ГруппаАналогов", Объект.ГруппаАналогов);
	Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивНайденнойНом = Новый Массив;
	Для каждого строкаТЧ ИЗ ТаблицаАналогов Цикл
		
		ВыборкаДетальныеЗаписи.Сбросить();
		Если НЕ ВыборкаДетальныеЗаписи.НайтиСледующий(строкаТЧ.Аналог, "Номенклатура") Тогда
			
			НачатьТранзакцию();
			Менеджер = РегистрыСведений.АналогиНоменклатуры.СоздатьМенеджерЗаписи();
			Менеджер.Номенклатура = строкаТЧ.Аналог;
			Менеджер.ГруппаАналогов = Объект.ГруппаАналогов;
			Менеджер.Записать();
			
			// ToDo: Сделать реквизит "Группа аналогов" необзяательным - читать просто запись из регистра - какая группа привязана к номенклатуре и из него и заполнять
			// тогда не надо будет писать объект - будет упрощение
			// сложность в том, что надо будет обеспечить корректность его заполнения
			ОбъектНом = строкаТЧ.Аналог.ПолучитьОбъект();
			ОбъектНом.ГруппаАналогов = ПредопределенноеЗначение("Справочник.ГруппыАналогов.ПустаяСсылка");
			Попытка
				ОбъектНом.записать();
				ЗафиксироватьТранзакцию();
			Исключение
				Если ТранзакцияАктивна() Тогда
					ОтменитьТранзакцию();
				КонецЕсли;
				Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
			
		Иначе
			МассивНайденнойНом.Добавить(строкаТЧ.Аналог);
		КонецЕсли;
		
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи.Сбросить();
	ПараметрыОтбора = Новый Структура("Аналог", "");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если МассивНайденнойНом.Найти(ВыборкаДетальныеЗаписи.Номенклатура) = Неопределено Тогда
			
			ОбъектНом = ВыборкаДетальныеЗаписи.Номенклатура.ПолучитьОбъект();
			ОбъектНом.ГруппаАналогов = ПредопределенноеЗначение("Справочник.ГруппыАналогов.ПустаяСсылка");
			ОбъектНом.записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАналоговПриИзменении(Элемент)
	ТаблицаАналоговИзменилась = Истина;
КонецПроцедуры
